#   Вводится вектор. Вывести максимум из его элементов.


#   Вводится вектор. Заменить в нём каждое число Фибоначчи на следующее.



#	Напишите программу, которая помогает определить какие вещи могут поместиться в рюкзак.
#	Вводится существующий объем рюкзака. Затем вводятся объемы всех вещей, которые хочется туда поместить.
#	Нужно вывести список объемов вещей, которые поместятся в рюкзак.
#	Постарайтесь максимизировать кол-во вошедших вещей.
v = int(input('Объем рюкзака:'))
items = int(input('Количество предметов:'))
for i in items:



#   Данные об email-адресах студентов хранятся в словаре: {домен:логины}.
#   Нужно дополнить код таким образом, чтобы он вывел все адреса в алфавитном порядке и в формате имя_пользователя@домен